Documents/гф_ДанныеЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>гф_ДанныеЗагрузки</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Интерфейс</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.гф_Интерфейсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.гф_СтатусыДокументовЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/гф_ОшибкиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>гф_ОшибкиЗагрузки</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьФайла</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/гф_ДанныеЗагрузки/Ext/ManagerModule.bsl
// Записывает строки в РС гф_ОшибкиЗагрузки по значениям из ТЗ "ТекстыОшибок" 
// Галфинд_Домнышева 2022/10/13
//
// Параметры:
//	ДокументДанные - ДокументСсылка.гф_ДанныеЗагрузки.
//	ОчиститьПослеЗаписиВРегистр - Булево - признак очистки таблицы с ошибками после после записи в регистр 
//
Процедура ЗаписатьОшибки(ДокументДанные, ОчиститьПослеЗаписиВРегистр = Истина) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса(); // Галфинд_Домнышева_20_03_2023
	Если ДокументДанные.ДополнительныеСвойства.Свойство("ТекстыОшибок") Тогда
		ТекстыОшибок = ДокументДанные.ДополнительныеСвойства.ТекстыОшибок;
		
		Попытка	
			НаборЗаписей = РегистрыСведений.гф_ОшибкиЗагрузки.СоздатьНаборЗаписей(); 
			//НаборЗаписей.Отбор.Дата.Установить(ДокументДанные.Дата); // Галфинд_Домнышева_20_03_2023 
			НаборЗаписей.Отбор.ПутьФайла.Установить(ДокументДанные.ПолноеИмяФайла);
			НаборЗаписей.Отбор.Организация.Установить(ДокументДанные.Организация);
			НаборЗаписей.Отбор.Интерфейс.Установить(ДокументДанные.Интерфейс);
			
			Для каждого Элемент Из ТекстыОшибок Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить(); 
				//НоваяЗапись.Дата = Элемент.Дата; // Галфинд_Домнышева_20_03_2023
				НоваяЗапись.Дата = ТекущаяДата; 
				НоваяЗапись.ПутьФайла = Элемент.ПутьФайла; 
				НоваяЗапись.Номер = Элемент.Номер;
				НоваяЗапись.ТекстОшибки = Элемент.ТекстОшибки;
				НоваяЗапись.Организация = Элемент.Организация;
				НоваяЗапись.Интерфейс = Элемент.Интерфейс;
				НоваяЗапись.ТипИнформации = Элемент.ТипИнформации;
				
			КонецЦикла;
			НаборЗаписей.Записать();
			
			Если ОчиститьПослеЗаписиВРегистр Тогда
				ДокументДанные.ДополнительныеСвойства.ТекстыОшибок.Очистить();
			КонецЕсли;
			
		Исключение
			
			Если ЗначениеЗаполнено(ДокументДанные.Интерфейс) Тогда
				СобытиеЖурналаРегистрации = "ЗагрузкаИзI5." + ДокументДанные.Интерфейс;
			Иначе
				СобытиеЖурналаРегистрации = "ЗагрузкаИзI5";
			КонецЕсли;
			
			СообщениеОбОшибке = "Ошибка при проведении документа " + ДокументДанные.Ссылка  
				+ ". Не удалось записать ТекстОшибки в РС гф_ОшибкиЗагрузки: " + ОписаниеОшибки();
				
			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации, УровеньЖурналаРегистрации.Ошибка,, ДокументДанные.Ссылка, СообщениеОбОшибке);		
			
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры
